dj-oyu/esp32p4-mqjs/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_SPIRAM=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# M5Stamp-P4 ships chip revision v1.x; IDF 6.0 defaults to v3.01 (ECO5)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Custom table: large factory app + LittleFS "storage" for persisted tasks
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# WiFi via Stamp-AddOn C6 (esp-hosted slave over SDIO, esp_wifi_remote on host).
# P4 SDMMC slot 0 has fixed IOMUX pins, so the Stamp wiring needs slot 1
# (GPIO matrix): CLK=43 CMD=44 D0..D3=45..48, C6 reset on GPIO42.
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=43
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=44
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=45
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=46
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=47
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=48
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=42

# Tab5 UI console: break long words anywhere so console lines use the
# full panel width (default 0 moves whole unbreakable words to the next
# line, leaving big right-side gaps). Harmless on Stamp (LVGL unlinked).
CONFIG_LV_TXT_LINE_BREAK_LONG_LEN=6

# LVGL heap (W1-1): builtin tlsf pool whose backing memory comes from
# PSRAM — LV_MEM_POOL_ALLOC is defined to heap_caps_malloc(MALLOC_CAP_SPIRAM)
# on the lvgl target in components/ui_tab5/CMakeLists.txt, so lv_init()
# carves the whole pool out of the 32MB PSRAM at runtime (LV_MEM_ADR can't
# do that: it needs a compile-time address). Widget churn (screens/forms,
# widget-framework-design.md §4①) then never touches scarce internal RAM.
# History: the previous CLIB malloc (internal RAM) was itself a workaround
# for ~200 console labels exhausting the old 64KB builtin pool; the 3MB
# PSRAM pool fixes that for real. Harmless on Stamp (LVGL never inits).
CONFIG_LV_USE_BUILTIN_MALLOC=y
CONFIG_LV_MEM_SIZE_KILOBYTES=3072

# wolfSSL/wolfSSH (components/sshc, pulled unconditionally). These make it
# compile cleanly on BOTH Tab5 and Stamp; the actual SSH client is gated
# by CONFIG_MQJS_SSH (Tab5 only, in sdkconfig.tab5.defaults) and dropped
# by --gc-sections when off, so Stamp flash is unaffected.
#   ENABLE_WOLFSSH: turn on WOLFSSH_TERM etc. in wolfSSL's user_settings.h
#   NO_STACK_SIZE_BUILD_WARNING: silence the RSA-vs-3.5KB-main-stack
#     #warning that -Werror=cpp makes fatal (SSH runs on its own 8KB task)
CONFIG_ESP_ENABLE_WOLFSSH=y
CONFIG_ESP_WOLFSSL_NO_STACK_SIZE_BUILD_WARNING=y
